## библиотека pandas

### data frame

In [1]:
import pandas as pd

In [6]:
df = pd.DataFrame({'numbers': range(10), 'char': ['a']*10})

In [7]:
df

  char  numbers
0    a        0
1    a        1
2    a        2
3    a        3
4    a        4
5    a        5
6    a        6
7    a        7
8    a        8
9    a        9

In [19]:
df = pd.read_csv("dataset.tsv", header=0, sep='\t')

In [11]:
df

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [12]:
df.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [13]:
df.shape

(6, 4)

In [14]:
nl = {"Name" : "Petrov", "Birth": "01.01.1970", "City": "Penza"}

In [20]:
df.append(nl, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Petrov  01.01.1970      Penza       NaN

In [21]:
df

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [22]:
df = df.append(nl, ignore_index=True)

In [23]:
df

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Petrov  01.01.1970      Penza       NaN

In [18]:
nl

{'Birth': '01.01.1970', 'City': 'Penza', 'Name': 'Petrov'}

In [24]:
df['IsStudent'] = [False]*5 + [True]*2

In [25]:
df

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6           Petrov  01.01.1970      Penza       NaN       True

In [26]:
df.drop([5,6], axis=0)

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [27]:
df.drop([5,6], axis=0, inplace=True)

In [28]:
df

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False

In [29]:
df.drop(["IsStudent"], axis=1, inplace=True)

In [30]:
df

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [31]:
df.to_csv("updated.dataframe.txt", sep=",", header=True, index=False)

In [32]:
!cat updated.dataframe.txt

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер

### dataframe operations

In [33]:
df = pd.read_csv("dataset.tsv", sep='\t', header=0)

In [34]:
df

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [35]:
df.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [36]:
df.Birth = df.Birth.apply(pd.to_datetime)

In [37]:
df

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [38]:
df.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [41]:
df.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [40]:
pd.__version__

u'0.20.1'

In [43]:
df.fillna("разнорабочий", inplace=True)

In [44]:
df

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [45]:
df.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [48]:
df[["Position"]]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [49]:
df[['Name','Position']]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [50]:
df.head(3)

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [51]:
df[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [52]:
df[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [55]:
df.loc[[1,3,5], ['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [56]:
df.iloc[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [59]:
df.ix[[1,3,5],["Name","City"]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [60]:
df.ix[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [65]:
df[df.Birth >= pd.to_datetime('01.01.1985')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [63]:
df.info

<bound method DataFrame.info of               Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер>

In [66]:
df[(df.Birth >= pd.to_datetime("01.01.1985")) & (df.City != "Москва")]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий

In [67]:
df[(df.Birth >= pd.to_datetime("01.01.1985")) | (df.City == "Волгоград")]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [68]:
df.size

24

In [71]:
df.shape

(6, 4)

In [76]:
df["isStudent"] = [True] + [False] * 5

In [84]:
df.drop("isStudent", axis=1, inplace=True)

In [79]:
df["isStudent"] = (True, True, True, True, True, True)

In [80]:
df

              Name      Birth       City      Position  isStudent
0      Иванов А.А. 1980-03-22     Москва  разнорабочий       True
1     Сорокин И.В. 1965-07-08  Волгоград       инженер       True
2       Белов М.М. 1980-02-13     Ростов      менеджер       True
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий       True
4      Рыбина Е.П. 1985-11-19     Москва       инженер       True
5     Костров С.О. 1985-05-31     Москва        стажер       True

In [82]:
df["isStudent"] = True, True, True, True, True, True

In [83]:
df

              Name      Birth       City      Position  isStudent
0      Иванов А.А. 1980-03-22     Москва  разнорабочий       True
1     Сорокин И.В. 1965-07-08  Волгоград       инженер       True
2       Белов М.М. 1980-02-13     Ростов      менеджер       True
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий       True
4      Рыбина Е.П. 1985-11-19     Москва       инженер       True
5     Костров С.О. 1985-05-31     Москва        стажер       True

In [85]:
df["isStudent"] = True True True True True True

SyntaxError: invalid syntax (<ipython-input-85-311746006c72>, line 1)